------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Joanna\Dropbox\Repositories\NLSY97_Breadwinning\nlsy97_hh5_2019.05.07.log
  log type:  text
 opened on:   7 May 2019, 14:48:17

. 
. ************************************************************************************************************
. /// Import the data
> 
. // Data: Mothers who had first birth between ages 18-27. 
. // Breadwinning 50% threshold. Mom's earnings/Household earnings
. 
. /*
> import  delimited C:\Users\Joanna\Dropbox\Repositories\NLSY97_Breadwinning\NLSY97_hh5.csv
> save    "C:\Users\Joanna\Dropbox\Repositories\NLSY97_Breadwinning\nlsy97_hh5.dta", replace
> */
. use     "C:\Users\Joanna\Dropbox\Repositories\NLSY97_Breadwinning\nlsy97_hh5.dta", clear

. 
. // pubid_1997  == caseid
. // Time: year of first birth == 3
. // Status: Not a breadwinner == 0, Breadwinner == 1
. 
. label define timelbl    1 "Minus 2" 2 "Minus 1" 3 "Year of 1st Birth" 4 "Plus 1" 5 "Plus 2" 6 "Plus 3" ///
>                                                 7 "Plus 4"      8 "Plus 5"      9 "Plus 6"      10 "Plus 7" 11 "Plus 8" 12 "Plus 9" 13 "Plus 10"

. label values time timelbl

.                                                 
. label define statuslbl  0 "Not a breadwinner" 1 "Breadwinner"

. label values status statuslbl

. 
. ************************************************************************************************************
. /// Preview the structure of the data
> 
. list if pubid_1997 < 10 & status !=.

        +----------------------------------------------------------------+
        | pub~1997   year   type                time              status |
        |----------------------------------------------------------------|
   106. |        3   2009   hhe5             Minus 1         Breadwinner |
   121. |        3   2011   hhe5              Plus 1   Not a breadwinner |
   136. |        3   2013   hhe5              Plus 3   Not a breadwinner |
   183. |        4   2001   hhe5             Minus 2         Breadwinner |
   197. |        4   2002   hhe5             Minus 1   Not a breadwinner |
        |----------------------------------------------------------------|
   211. |        4   2003   hhe5   Year of 1st Birth         Breadwinner |
   225. |        4   2004   hhe5              Plus 1         Breadwinner |
   239. |        4   2005   hhe5              Plus 2   Not a breadwinner |
   253. |        4   2006   hhe5              Plus 3   Not a breadwinner |
   267. |        4   2007   hhe5              Plus 4         Breadwinner |
        |----------------------------------------------------------------|
   295. |        4   2009   hhe5              Plus 6         Breadwinner |
   309. |        4   2010   hhe5              Plus 7         Breadwinner |
   323. |        4   2011   hhe5              Plus 8         Breadwinner |
   338. |        4   2013   hhe5             Plus 10   Not a breadwinner |
   482. |        6   2007   hhe5             Minus 2   Not a breadwinner |
        |----------------------------------------------------------------|
   496. |        6   2008   hhe5             Minus 1   Not a breadwinner |
   510. |        6   2009   hhe5   Year of 1st Birth   Not a breadwinner |
   524. |        6   2010   hhe5              Plus 1   Not a breadwinner |
   538. |        6   2011   hhe5              Plus 2   Not a breadwinner |
   553. |        6   2013   hhe5              Plus 4   Not a breadwinner |
        |----------------------------------------------------------------|
   568. |        6   2015   hhe5              Plus 6   Not a breadwinner |
        +----------------------------------------------------------------+

. 
. tab time status

                  |        status
             time | Not a bre  Breadwinn |     Total
------------------+----------------------+----------
          Minus 2 |       535        837 |     1,372 
          Minus 1 |       777        720 |     1,497 
Year of 1st Birth |       895        612 |     1,507 
           Plus 1 |       866        630 |     1,496 
           Plus 2 |       901        603 |     1,504 
           Plus 3 |       845        590 |     1,435 
           Plus 4 |       834        591 |     1,425 
           Plus 5 |       766        516 |     1,282 
           Plus 6 |       724        512 |     1,236 
           Plus 7 |       611        424 |     1,035 
           Plus 8 |       532        383 |       915 
           Plus 9 |       402        333 |       735 
          Plus 10 |       335        247 |       582 
------------------+----------------------+----------
            Total |     9,023      6,998 |    16,021 

. tab status

           status |      Freq.     Percent        Cum.
------------------+-----------------------------------
Not a breadwinner |      9,023       56.32       56.32
      Breadwinner |      6,998       43.68      100.00
------------------+-----------------------------------
            Total |     16,021      100.00

. 
. ************************************************************************************************************
. /// create variables for breadwinning status at m1 and m2
> 
. egen m_2        = max(status) if time == 1,  by(pubid_1997) 
(377521 missing values generated)

. egen m_1        = max(status) if time == 2,  by(pubid_1997) 
(375791 missing values generated)

. egen t_0        = max(status) if time == 3,  by(pubid_1997) 
(375495 missing values generated)

. egen t_1        = max(status) if time == 4,  by(pubid_1997) 
(375524 missing values generated)

. egen t_2        = max(status) if time == 5,  by(pubid_1997) 
(375393 missing values generated)

. egen t_3        = max(status) if time == 6,  by(pubid_1997) 
(376542 missing values generated)

. egen t_4        = max(status) if time == 7,  by(pubid_1997) 
(376713 missing values generated)

. egen t_5        = max(status) if time == 8,  by(pubid_1997) 
(379048 missing values generated)

. egen t_6        = max(status) if time == 9,  by(pubid_1997) 
(379778 missing values generated)

. egen t_7        = max(status) if time == 10, by(pubid_1997) 
(382930 missing values generated)

. egen t_8        = max(status) if time == 11, by(pubid_1997) 
(385000 missing values generated)

. egen t_9        = max(status) if time == 12, by(pubid_1997) 
(387702 missing values generated)

. egen t_10       = max(status) if time == 13, by(pubid_1997) 
(390292 missing values generated)

. 
. egen m2         = max(m_2),     by(pubid_1997)
(112801 missing values generated)

. egen m1         = max(m_1),     by(pubid_1997) 
(90311 missing values generated)

. egen t0         = max(t_0),     by(pubid_1997) 
(86463 missing values generated)

. egen t1         = max(t_1),     by(pubid_1997) 
(86840 missing values generated)

. egen t2         = max(t_2),     by(pubid_1997) 
(85137 missing values generated)

. egen t3         = max(t_3),     by(pubid_1997) 
(100074 missing values generated)

. egen t4         = max(t_4),     by(pubid_1997) 
(102297 missing values generated)

. egen t5         = max(t_5),     by(pubid_1997) 
(132652 missing values generated)

. egen t6         = max(t_6),     by(pubid_1997) 
(142142 missing values generated)

. egen t7         = max(t_7),     by(pubid_1997) 
(183118 missing values generated)

. egen t8         = max(t_8),     by(pubid_1997) 
(210028 missing values generated)

. egen t9         = max(t_9),     by(pubid_1997) 
(245154 missing values generated)

. egen t10        = max(t_10),    by(pubid_1997) 
(278824 missing values generated)

. 
. drop m_2 m_1 t_0 t_1 t_2 t_3 t_4 t_5 t_6 t_7 t_8 t_9 t_10

. 
. /// If you select on time > 2 and time <=9 what do the distributions on m1 and m2 look like?
> 
. cap drop flag

. gen flag =.
(399,581 missing values generated)

. replace flag = 1 if time > 2 & time <=9
(215,159 real changes made)

. 
. tab m1 if flag ==1

         m1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     86,317       51.83       51.83
          1 |     80,213       48.17      100.00
------------+-----------------------------------
      Total |    166,530      100.00

. tab m2 if flag ==1

         m2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     59,997       38.85       38.85
          1 |     94,423       61.15      100.00
------------+-----------------------------------
      Total |    154,420      100.00

. 
. preserve

. collapse (max)  m2 m1 t0 t1 t2 t3 t4 t5 ///
>                                 t6 t7 t8 t9 t10, by(pubid_1997 time)

.                                 
. tab time if m2!=.

             time |      Freq.     Percent        Cum.
------------------+-----------------------------------
          Minus 2 |      1,363        7.69        7.69
          Minus 1 |      1,363        7.69       15.38
Year of 1st Birth |      1,363        7.69       23.08
           Plus 1 |      1,363        7.69       30.77
           Plus 2 |      1,363        7.69       38.46
           Plus 3 |      1,363        7.69       46.15
           Plus 4 |      1,363        7.69       53.85
           Plus 5 |      1,363        7.69       61.54
           Plus 6 |      1,363        7.69       69.23
           Plus 7 |      1,363        7.69       76.92
           Plus 8 |      1,363        7.69       84.62
           Plus 9 |      1,363        7.69       92.31
          Plus 10 |      1,363        7.69      100.00
------------------+-----------------------------------
            Total |     17,719      100.00

. tab time if m2!=. & m1!=.

             time |      Freq.     Percent        Cum.
------------------+-----------------------------------
          Minus 2 |      1,187        7.69        7.69
          Minus 1 |      1,187        7.69       15.38
Year of 1st Birth |      1,187        7.69       23.08
           Plus 1 |      1,187        7.69       30.77
           Plus 2 |      1,187        7.69       38.46
           Plus 3 |      1,187        7.69       46.15
           Plus 4 |      1,187        7.69       53.85
           Plus 5 |      1,187        7.69       61.54
           Plus 6 |      1,187        7.69       69.23
           Plus 7 |      1,187        7.69       76.92
           Plus 8 |      1,187        7.69       84.62
           Plus 9 |      1,187        7.69       92.31
          Plus 10 |      1,187        7.69      100.00
------------------+-----------------------------------
            Total |     15,431      100.00

. tab time if m2!=. & m1!=. & t0 !=.

             time |      Freq.     Percent        Cum.
------------------+-----------------------------------
          Minus 2 |      1,064        7.69        7.69
          Minus 1 |      1,064        7.69       15.38
Year of 1st Birth |      1,064        7.69       23.08
           Plus 1 |      1,064        7.69       30.77
           Plus 2 |      1,064        7.69       38.46
           Plus 3 |      1,064        7.69       46.15
           Plus 4 |      1,064        7.69       53.85
           Plus 5 |      1,064        7.69       61.54
           Plus 6 |      1,064        7.69       69.23
           Plus 7 |      1,064        7.69       76.92
           Plus 8 |      1,064        7.69       84.62
           Plus 9 |      1,064        7.69       92.31
          Plus 10 |      1,064        7.69      100.00
------------------+-----------------------------------
            Total |     13,832      100.00

. tab time if m2!=. & m1!=. & t0 !=. & t1 !=.

             time |      Freq.     Percent        Cum.
------------------+-----------------------------------
          Minus 2 |        935        7.69        7.69
          Minus 1 |        935        7.69       15.38
Year of 1st Birth |        935        7.69       23.08
           Plus 1 |        935        7.69       30.77
           Plus 2 |        935        7.69       38.46
           Plus 3 |        935        7.69       46.15
           Plus 4 |        935        7.69       53.85
           Plus 5 |        935        7.69       61.54
           Plus 6 |        935        7.69       69.23
           Plus 7 |        935        7.69       76.92
           Plus 8 |        935        7.69       84.62
           Plus 9 |        935        7.69       92.31
          Plus 10 |        935        7.69      100.00
------------------+-----------------------------------
            Total |     12,155      100.00

. tab time if m2!=. & m1!=. & t0 !=. & t1 !=. & t2 !=.

             time |      Freq.     Percent        Cum.
------------------+-----------------------------------
          Minus 2 |        831        7.69        7.69
          Minus 1 |        831        7.69       15.38
Year of 1st Birth |        831        7.69       23.08
           Plus 1 |        831        7.69       30.77
           Plus 2 |        831        7.69       38.46
           Plus 3 |        831        7.69       46.15
           Plus 4 |        831        7.69       53.85
           Plus 5 |        831        7.69       61.54
           Plus 6 |        831        7.69       69.23
           Plus 7 |        831        7.69       76.92
           Plus 8 |        831        7.69       84.62
           Plus 9 |        831        7.69       92.31
          Plus 10 |        831        7.69      100.00
------------------+-----------------------------------
            Total |     10,803      100.00

. 
. tab time if m1!=.

             time |      Freq.     Percent        Cum.
------------------+-----------------------------------
          Minus 2 |      1,485        7.69        7.69
          Minus 1 |      1,485        7.69       15.38
Year of 1st Birth |      1,485        7.69       23.08
           Plus 1 |      1,485        7.69       30.77
           Plus 2 |      1,485        7.69       38.46
           Plus 3 |      1,485        7.69       46.15
           Plus 4 |      1,485        7.69       53.85
           Plus 5 |      1,485        7.69       61.54
           Plus 6 |      1,485        7.69       69.23
           Plus 7 |      1,485        7.69       76.92
           Plus 8 |      1,485        7.69       84.62
           Plus 9 |      1,485        7.69       92.31
          Plus 10 |      1,485        7.69      100.00
------------------+-----------------------------------
            Total |     19,305      100.00

. tab time if m1!=. & t0 !=.

             time |      Freq.     Percent        Cum.
------------------+-----------------------------------
          Minus 2 |      1,277        7.69        7.69
          Minus 1 |      1,277        7.69       15.38
Year of 1st Birth |      1,277        7.69       23.08
           Plus 1 |      1,277        7.69       30.77
           Plus 2 |      1,277        7.69       38.46
           Plus 3 |      1,277        7.69       46.15
           Plus 4 |      1,277        7.69       53.85
           Plus 5 |      1,277        7.69       61.54
           Plus 6 |      1,277        7.69       69.23
           Plus 7 |      1,277        7.69       76.92
           Plus 8 |      1,277        7.69       84.62
           Plus 9 |      1,277        7.69       92.31
          Plus 10 |      1,277        7.69      100.00
------------------+-----------------------------------
            Total |     16,601      100.00

. tab time if m1!=. & t0 !=. & t1 !=.

             time |      Freq.     Percent        Cum.
------------------+-----------------------------------
          Minus 2 |      1,107        7.69        7.69
          Minus 1 |      1,107        7.69       15.38
Year of 1st Birth |      1,107        7.69       23.08
           Plus 1 |      1,107        7.69       30.77
           Plus 2 |      1,107        7.69       38.46
           Plus 3 |      1,107        7.69       46.15
           Plus 4 |      1,107        7.69       53.85
           Plus 5 |      1,107        7.69       61.54
           Plus 6 |      1,107        7.69       69.23
           Plus 7 |      1,107        7.69       76.92
           Plus 8 |      1,107        7.69       84.62
           Plus 9 |      1,107        7.69       92.31
          Plus 10 |      1,107        7.69      100.00
------------------+-----------------------------------
            Total |     14,391      100.00

. tab time if m1!=. & t0 !=. & t1 !=. & t2 !=.

             time |      Freq.     Percent        Cum.
------------------+-----------------------------------
          Minus 2 |        979        7.69        7.69
          Minus 1 |        979        7.69       15.38
Year of 1st Birth |        979        7.69       23.08
           Plus 1 |        979        7.69       30.77
           Plus 2 |        979        7.69       38.46
           Plus 3 |        979        7.69       46.15
           Plus 4 |        979        7.69       53.85
           Plus 5 |        979        7.69       61.54
           Plus 6 |        979        7.69       69.23
           Plus 7 |        979        7.69       76.92
           Plus 8 |        979        7.69       84.62
           Plus 9 |        979        7.69       92.31
          Plus 10 |        979        7.69      100.00
------------------+-----------------------------------
            Total |     12,727      100.00

. 
. tab time if t0 !=.

             time |      Freq.     Percent        Cum.
------------------+-----------------------------------
          Minus 2 |      1,497        7.69        7.69
          Minus 1 |      1,497        7.69       15.38
Year of 1st Birth |      1,497        7.69       23.08
           Plus 1 |      1,497        7.69       30.77
           Plus 2 |      1,497        7.69       38.46
           Plus 3 |      1,497        7.69       46.15
           Plus 4 |      1,497        7.69       53.85
           Plus 5 |      1,497        7.69       61.54
           Plus 6 |      1,497        7.69       69.23
           Plus 7 |      1,497        7.69       76.92
           Plus 8 |      1,497        7.69       84.62
           Plus 9 |      1,497        7.69       92.31
          Plus 10 |      1,497        7.69      100.00
------------------+-----------------------------------
            Total |     19,461      100.00

. tab time if t0 !=. & t1 !=.

             time |      Freq.     Percent        Cum.
------------------+-----------------------------------
          Minus 2 |      1,261        7.69        7.69
          Minus 1 |      1,261        7.69       15.38
Year of 1st Birth |      1,261        7.69       23.08
           Plus 1 |      1,261        7.69       30.77
           Plus 2 |      1,261        7.69       38.46
           Plus 3 |      1,261        7.69       46.15
           Plus 4 |      1,261        7.69       53.85
           Plus 5 |      1,261        7.69       61.54
           Plus 6 |      1,261        7.69       69.23
           Plus 7 |      1,261        7.69       76.92
           Plus 8 |      1,261        7.69       84.62
           Plus 9 |      1,261        7.69       92.31
          Plus 10 |      1,261        7.69      100.00
------------------+-----------------------------------
            Total |     16,393      100.00

. tab time if t0 !=. & t1 !=. & t2 !=.

             time |      Freq.     Percent        Cum.
------------------+-----------------------------------
          Minus 2 |      1,113        7.69        7.69
          Minus 1 |      1,113        7.69       15.38
Year of 1st Birth |      1,113        7.69       23.08
           Plus 1 |      1,113        7.69       30.77
           Plus 2 |      1,113        7.69       38.46
           Plus 3 |      1,113        7.69       46.15
           Plus 4 |      1,113        7.69       53.85
           Plus 5 |      1,113        7.69       61.54
           Plus 6 |      1,113        7.69       69.23
           Plus 7 |      1,113        7.69       76.92
           Plus 8 |      1,113        7.69       84.62
           Plus 9 |      1,113        7.69       92.31
          Plus 10 |      1,113        7.69      100.00
------------------+-----------------------------------
            Total |     14,469      100.00

. restore

. 
. // Limit to rows with out missing breadwinning status
. keep if status !=.
(383,560 observations deleted)

. 
. // breadwinning at time 0 dependent on breadwinning at t1 and t2
. // need a group var for person?
. logit t0 ib3.time m1     if time <=3    // Just t-minus 1

Iteration 0:   log likelihood = -2442.8765  
Iteration 1:   log likelihood = -2030.2717  
Iteration 2:   log likelihood = -2024.5906  
Iteration 3:   log likelihood = -2024.5869  
Iteration 4:   log likelihood = -2024.5869  

Logistic regression                             Number of obs     =      3,649
                                                LR chi2(3)        =     836.58
                                                Prob > chi2       =     0.0000
Log likelihood = -2024.5869                     Pseudo R2         =     0.1712

------------------------------------------------------------------------------
          t0 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        time |
    Minus 2  |   .0038373   .0959413     0.04   0.968    -.1842042    .1918789
    Minus 1  |  -.0056602   .0914432    -0.06   0.951    -.1848856    .1735651
             |
          m1 |   2.097411   .0778687    26.94   0.000     1.944791     2.25003
       _cons |  -1.534605   .0789726   -19.43   0.000    -1.689388   -1.379821
------------------------------------------------------------------------------

. logit t0 ib3.time m1 m2  if time <=3    // t-minus 1 & t-minus 2

Iteration 0:   log likelihood = -2157.0535  
Iteration 1:   log likelihood = -1754.3286  
Iteration 2:   log likelihood = -1748.2542  
Iteration 3:   log likelihood =  -1748.247  
Iteration 4:   log likelihood =  -1748.247  

Logistic regression                             Number of obs     =      3,221
                                                LR chi2(4)        =     817.61
                                                Prob > chi2       =     0.0000
Log likelihood =  -1748.247                     Pseudo R2         =     0.1895

------------------------------------------------------------------------------
          t0 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        time |
    Minus 2  |  -.0092072   .1014757    -0.09   0.928    -.2080959    .1896816
    Minus 1  |   -.007831   .1014143    -0.08   0.938    -.2065994    .1909374
             |
          m1 |   1.777465   .0881152    20.17   0.000     1.604762    1.950168
          m2 |   .8462235   .0922121     9.18   0.000     .6654912    1.026956
       _cons |  -1.880939   .0977005   -19.25   0.000    -2.072428   -1.689449
------------------------------------------------------------------------------

. 
. margins time

Predictive margins                              Number of obs     =      3,221
Model VCE    : OIM

Expression   : Pr(t0), predict()

------------------------------------------------------------------------------------
                   |            Delta-method
                   |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
              time |
          Minus 2  |   .3914759   .0129874    30.14   0.000     .3660211    .4169306
          Minus 1  |   .3917249   .0129735    30.19   0.000     .3662972    .4171525
Year of 1st Birth  |   .3931426   .0129917    30.26   0.000     .3676793    .4186059
------------------------------------------------------------------------------------

. marginsplot

  Variables that uniquely identify margins: time

. 
. log close
      name:  <unnamed>
       log:  C:\Users\Joanna\Dropbox\Repositories\NLSY97_Breadwinning\nlsy97_hh5_2019.05.07.log
  log type:  text
 closed on:   7 May 2019, 14:48:33
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
