--------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Joanna\Dropbox\Repositories\NLSY97_Breadwinning\logs\nlsy97_hh50_2019.05.11.log
  log type:  text
 opened on:  11 May 2019, 16:35:26

. 
. use     "C:\Users\Joanna\Dropbox\Repositories\NLSY97_Breadwinning\stata\nlsy97_hh50.dta", clear
(Written by R.              )

. 
. *select only observations since first birth
. keep if firstbirth==1   // selected on this in R already
(0 observations deleted)

. 
. drop firstbirth                 // this variable has no variation now 

. 
. reshape wide year hhe50, i(PUBID_1997) j(time)
(note: j = 0 1 2 3 4 5 6 7 8 9)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    18448   ->    1998
Number of variables                   4   ->      21
j variable (10 values)             time   ->   (dropped)
xij variables:
                                   year   ->   year0 year1 ... year9
                                  hhe50   ->   hhe500 hhe501 ... hhe509
-----------------------------------------------------------------------------

. 
. forvalues t=1/8{
  2.     local s=`t'-1
  3.     gen hhe50_minus1_`t'=hhe50`s' 
  4. }
(536 missing values generated)
(543 missing values generated)
(535 missing values generated)
(604 missing values generated)
(614 missing values generated)
(744 missing values generated)
(797 missing values generated)
(987 missing values generated)

. 
. forvalues t=2/8{
  2.     local r=`t'-2
  3.     gen hhe50_minus2_`t'=hhe50`r' 
  4. }
(536 missing values generated)
(543 missing values generated)
(535 missing values generated)
(604 missing values generated)
(614 missing values generated)
(744 missing values generated)
(797 missing values generated)

. 
. forvalues t=3/8{
  2.     local u=`t'-3
  3.     gen hhe50_minus3_`t'=hhe50`u' 
  4. }
(536 missing values generated)
(543 missing values generated)
(535 missing values generated)
(604 missing values generated)
(614 missing values generated)
(744 missing values generated)

. 
. forvalues t=4/8{
  2.     local v=`t'-4
  3.     gen hhe50_minus4_`t'=hhe50`v' 
  4. }
(536 missing values generated)
(543 missing values generated)
(535 missing values generated)
(604 missing values generated)
(614 missing values generated)

. 
. reshape long year hhe50 hhe50_minus1_ hhe50_minus2_ hhe50_minus3_ hhe50_minus4_, i(PUBID_1997) j(time)
(note: j = 0 1 2 3 4 5 6 7 8 9)
(note: hhe50_minus1_0 not found)
(note: hhe50_minus2_0 not found)
(note: hhe50_minus3_0 not found)
(note: hhe50_minus4_0 not found)
(note: hhe50_minus2_1 not found)
(note: hhe50_minus3_1 not found)
(note: hhe50_minus4_1 not found)
(note: hhe50_minus3_2 not found)
(note: hhe50_minus4_2 not found)
(note: hhe50_minus4_3 not found)
(note: hhe50_minus1_9 not found)
(note: hhe50_minus2_9 not found)
(note: hhe50_minus3_9 not found)
(note: hhe50_minus4_9 not found)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1998   ->   19980
Number of variables                  47   ->       8
j variable (10 values)                    ->   time
xij variables:
                  year0 year1 ... year9   ->   year
               hhe500 hhe501 ... hhe509   ->   hhe50
hhe50_minus1_0 hhe50_minus1_1 ... hhe50_minus1_9->hhe50_minus1_
hhe50_minus2_0 hhe50_minus2_1 ... hhe50_minus2_9->hhe50_minus2_
hhe50_minus3_0 hhe50_minus3_1 ... hhe50_minus3_9->hhe50_minus3_
hhe50_minus4_0 hhe50_minus4_1 ... hhe50_minus4_9->hhe50_minus4_
-----------------------------------------------------------------------------

. 
. * clean up observations created because reshape creates some number of observations for each (PUBID_19
> 97)
. drop if missing(year)
(1,532 observations deleted)

. 
. logit hhe50 hhe50_minus1 i.time

Iteration 0:   log likelihood = -5083.8841  
Iteration 1:   log likelihood = -3831.1823  
Iteration 2:   log likelihood = -3821.4443  
Iteration 3:   log likelihood = -3821.4311  
Iteration 4:   log likelihood = -3821.4311  

Logistic regression                             Number of obs     =      7,569
                                                LR chi2(8)        =    2524.91
                                                Prob > chi2       =     0.0000
Log likelihood = -3821.4311                     Pseudo R2         =     0.2483

-------------------------------------------------------------------------------
        hhe50 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
hhe50_minus1_ |   2.607744   .0571666    45.62   0.000     2.495699    2.719788
              |
         time |
           2  |  -.1205605   .1015669    -1.19   0.235    -.3196279     .078507
           3  |   .0487935   .1026095     0.48   0.634    -.1523174    .2499045
           4  |   .0463808    .104334     0.44   0.657    -.1581101    .2508718
           5  |  -.0466903   .1076907    -0.43   0.665    -.2577601    .1643795
           6  |   .1193881   .1114636     1.07   0.284    -.0990764    .3378527
           7  |   .1289354   .1189287     1.08   0.278    -.1041607    .3620315
           8  |  -.0264648   .1320491    -0.20   0.841    -.2852763    .2323467
              |
        _cons |  -1.588537   .0763016   -20.82   0.000    -1.738085   -1.438988
-------------------------------------------------------------------------------

. logit hhe50 hhe50_minus1 hhe50_minus2 i.time

Iteration 0:   log likelihood = -3756.5563  
Iteration 1:   log likelihood = -2721.8893  
Iteration 2:   log likelihood = -2711.0928  
Iteration 3:   log likelihood =  -2711.068  
Iteration 4:   log likelihood =  -2711.068  

Logistic regression                             Number of obs     =      5,630
                                                LR chi2(8)        =    2090.98
                                                Prob > chi2       =     0.0000
Log likelihood =  -2711.068                     Pseudo R2         =     0.2783

-------------------------------------------------------------------------------
        hhe50 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
hhe50_minus1_ |   2.084158   .0731501    28.49   0.000     1.940787     2.22753
hhe50_minus2_ |   1.135763   .0732693    15.50   0.000     .9921579    1.279368
              |
         time |
           3  |   .2189707   .1139743     1.92   0.055    -.0044148    .4423563
           4  |   .2410997   .1156311     2.09   0.037     .0144668    .4677326
           5  |   .0893738   .1194736     0.75   0.454    -.1447901    .3235377
           6  |   .2566718   .1231773     2.08   0.037     .0152486     .498095
           7  |   .2222651   .1301457     1.71   0.088    -.0328158    .4773459
           8  |   .1679484   .1432467     1.17   0.241      -.11281    .4487068
              |
        _cons |   -2.03305   .0901205   -22.56   0.000    -2.209683   -1.856417
-------------------------------------------------------------------------------

. logit hhe50 hhe50_minus1 hhe50_minus2 hhe50_minus3 i.time

Iteration 0:   log likelihood = -2707.2728  
Iteration 1:   log likelihood = -1928.2103  
Iteration 2:   log likelihood = -1919.3226  
Iteration 3:   log likelihood = -1919.2948  
Iteration 4:   log likelihood = -1919.2948  

Logistic regression                             Number of obs     =      4,066
                                                LR chi2(8)        =    1575.96
                                                Prob > chi2       =     0.0000
Log likelihood = -1919.2948                     Pseudo R2         =     0.2911

-------------------------------------------------------------------------------
        hhe50 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
hhe50_minus1_ |   2.019092   .0874274    23.09   0.000     1.847737    2.190446
hhe50_minus2_ |   .9220402   .0954892     9.66   0.000     .7348848    1.109196
hhe50_minus3_ |   .5837245   .0924811     6.31   0.000     .4024649    .7649842
              |
         time |
           4  |   .0095162   .1257645     0.08   0.940    -.2369776    .2560101
           5  |  -.1501169   .1301954    -1.15   0.249    -.4052952    .1050614
           6  |    .095222   .1333756     0.71   0.475    -.1661892    .3566333
           7  |   .0911965   .1401474     0.65   0.515    -.1834874    .3658804
           8  |   .0107788   .1534757     0.07   0.944     -.290028    .3115855
              |
        _cons |  -1.984264   .0997713   -19.89   0.000    -2.179812   -1.788716
-------------------------------------------------------------------------------

. logit hhe50 hhe50_minus1 hhe50_minus2 hhe50_minus3 hhe50_minus4 i.time

Iteration 0:   log likelihood = -1877.2052  
Iteration 1:   log likelihood = -1331.9048  
Iteration 2:   log likelihood = -1325.2613  
Iteration 3:   log likelihood = -1325.2384  
Iteration 4:   log likelihood = -1325.2384  

Logistic regression                             Number of obs     =      2,824
                                                LR chi2(8)        =    1103.93
                                                Prob > chi2       =     0.0000
Log likelihood = -1325.2384                     Pseudo R2         =     0.2940

-------------------------------------------------------------------------------
        hhe50 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
hhe50_minus1_ |   2.013696    .105855    19.02   0.000     1.806224    2.221168
hhe50_minus2_ |   .8599631   .1159319     7.42   0.000     .6327408    1.087186
hhe50_minus3_ |   .4642698   .1210068     3.84   0.000     .2271007    .7014388
hhe50_minus4_ |   .3094861   .1149557     2.69   0.007     .0841771    .5347951
              |
         time |
           5  |  -.1565126   .1415809    -1.11   0.269    -.4340062    .1209809
           6  |   .0940541   .1443945     0.65   0.515    -.1889539    .3770621
           7  |    .094079   .1510968     0.62   0.534    -.2020653    .3902233
           8  |   .0414636   .1637681     0.25   0.800    -.2795161    .3624432
              |
        _cons |  -2.030297   .1137343   -17.85   0.000    -2.253213   -1.807382
-------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\Joanna\Dropbox\Repositories\NLSY97_Breadwinning\logs\nlsy97_hh50_2019.05.11.log
  log type:  text
 closed on:  11 May 2019, 16:35:28
--------------------------------------------------------------------------------------------------------
