--------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Joanna\Dropbox\Repositories\NLSY97_Breadwinning\logs\nlsy97_hh60_2019.05.20.log
  log type:  text
 opened on:  20 May 2019, 12:40:39

. 
. use     "C:\Users\Joanna\Dropbox\Repositories\NLSY97_Breadwinning\stata\nlsy97_hh60.dta", clear
(Written by R.              )

. 
. *select only observations since first birth
. keep if firstbirth==1   // selected on this in R already
(0 observations deleted)

. 
. drop firstbirth                 // this variable has no variation now 

. 
. reshape wide year hhe60, i(PUBID_1997) j(time)
(note: j = 0 1 2 3 4 5 6 7 8 9)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    18448   ->    1998
Number of variables                   4   ->      21
j variable (10 values)             time   ->   (dropped)
xij variables:
                                   year   ->   year0 year1 ... year9
                                  hhe60   ->   hhe600 hhe601 ... hhe609
-----------------------------------------------------------------------------

. 
. forvalues t=1/8{
  2.     local s=`t'-1
  3.     gen hhe60_minus1_`t'=hhe60`s' 
  4. }
(536 missing values generated)
(543 missing values generated)
(535 missing values generated)
(604 missing values generated)
(614 missing values generated)
(744 missing values generated)
(797 missing values generated)
(987 missing values generated)

. 
. forvalues t=2/8{
  2.     local r=`t'-2
  3.     gen hhe60_minus2_`t'=hhe60`r' 
  4. }
(536 missing values generated)
(543 missing values generated)
(535 missing values generated)
(604 missing values generated)
(614 missing values generated)
(744 missing values generated)
(797 missing values generated)

. 
. forvalues t=3/8{
  2.     local u=`t'-3
  3.     gen hhe60_minus3_`t'=hhe60`u' 
  4. }
(536 missing values generated)
(543 missing values generated)
(535 missing values generated)
(604 missing values generated)
(614 missing values generated)
(744 missing values generated)

. 
. forvalues t=4/8{
  2.     local v=`t'-4
  3.     gen hhe60_minus4_`t'=hhe60`v' 
  4. }
(536 missing values generated)
(543 missing values generated)
(535 missing values generated)
(604 missing values generated)
(614 missing values generated)

. 
. reshape long year hhe60 hhe60_minus1_ hhe60_minus2_ hhe60_minus3_ hhe60_minus4_, i(PUBID_1997) j(time)
(note: j = 0 1 2 3 4 5 6 7 8 9)
(note: hhe60_minus1_0 not found)
(note: hhe60_minus2_0 not found)
(note: hhe60_minus3_0 not found)
(note: hhe60_minus4_0 not found)
(note: hhe60_minus2_1 not found)
(note: hhe60_minus3_1 not found)
(note: hhe60_minus4_1 not found)
(note: hhe60_minus3_2 not found)
(note: hhe60_minus4_2 not found)
(note: hhe60_minus4_3 not found)
(note: hhe60_minus1_9 not found)
(note: hhe60_minus2_9 not found)
(note: hhe60_minus3_9 not found)
(note: hhe60_minus4_9 not found)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1998   ->   19980
Number of variables                  47   ->       8
j variable (10 values)                    ->   time
xij variables:
                  year0 year1 ... year9   ->   year
               hhe600 hhe601 ... hhe609   ->   hhe60
hhe60_minus1_0 hhe60_minus1_1 ... hhe60_minus1_9->hhe60_minus1_
hhe60_minus2_0 hhe60_minus2_1 ... hhe60_minus2_9->hhe60_minus2_
hhe60_minus3_0 hhe60_minus3_1 ... hhe60_minus3_9->hhe60_minus3_
hhe60_minus4_0 hhe60_minus4_1 ... hhe60_minus4_9->hhe60_minus4_
-----------------------------------------------------------------------------

. 
. * clean up observations created because reshape creates some number of observations for each (PUBID_19
> 97)
. drop if missing(year)
(1,532 observations deleted)

. 
. logit hhe60 i.hhe60_minus1 i.time, or

Iteration 0:   log likelihood = -4898.5708  
Iteration 1:   log likelihood = -3614.3489  
Iteration 2:   log likelihood =  -3591.955  
Iteration 3:   log likelihood = -3591.9133  
Iteration 4:   log likelihood = -3591.9133  

Logistic regression                             Number of obs     =      7,569
                                                LR chi2(8)        =    2613.31
                                                Prob > chi2       =     0.0000
Log likelihood = -3591.9133                     Pseudo R2         =     0.2667

---------------------------------------------------------------------------------
          hhe60 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.hhe60_minus1_ |    15.6731   .9330534    46.23   0.000     13.94701    17.61282
                |
           time |
             2  |   .8744153   .0925861    -1.27   0.205     .7105418    1.076083
             3  |    1.04798   .1118663     0.44   0.661     .8501428    1.291856
             4  |   1.028482   .1116294     0.26   0.796     .8313979    1.272285
             5  |   .9154789   .1026478    -0.79   0.431     .7348651    1.140484
             6  |   1.117675   .1294679     0.96   0.337     .8906662    1.402542
             7  |   1.040387   .1289233     0.32   0.749     .8160469      1.3264
             8  |   1.062387   .1455359     0.44   0.659     .8122262    1.389596
                |
          _cons |   .1689142   .0133766   -22.46   0.000     .1446299     .197276
---------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. logit hhe60 i.hhe60_minus1 i.hhe60_minus2 i.time, or

Iteration 0:   log likelihood = -3603.5641  
Iteration 1:   log likelihood = -2550.8008  
Iteration 2:   log likelihood = -2528.4388  
Iteration 3:   log likelihood = -2528.3436  
Iteration 4:   log likelihood = -2528.3435  

Logistic regression                             Number of obs     =      5,630
                                                LR chi2(8)        =    2150.44
                                                Prob > chi2       =     0.0000
Log likelihood = -2528.3435                     Pseudo R2         =     0.2984

---------------------------------------------------------------------------------
          hhe60 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.hhe60_minus1_ |   8.739124   .6700522    28.27   0.000      7.51976    10.15621
1.hhe60_minus2_ |   3.414588   .2625535    15.97   0.000     2.936892    3.969983
                |
           time |
             3  |   1.233565    .147523     1.76   0.079     .9758123    1.559401
             4  |   1.245963   .1506418     1.82   0.069     .9830857    1.579133
             5  |   1.069331   .1338764     0.54   0.592     .8366524     1.36672
             6  |   1.317106    .169261     2.14   0.032     1.023843    1.694371
             7  |   1.192459   .1623972     1.29   0.196     .9131057    1.557277
             8  |   1.305353   .1951407     1.78   0.075     .9738219    1.749751
                |
          _cons |    .107461   .0100975   -23.74   0.000     .0893857    .1291914
---------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. logit hhe60 i.hhe60_minus1 i.hhe60_minus2 i.hhe60_minus3 i.time, or

Iteration 0:   log likelihood = -2587.8355  
Iteration 1:   log likelihood = -1819.0254  
Iteration 2:   log likelihood = -1801.7641  
Iteration 3:   log likelihood = -1801.6831  
Iteration 4:   log likelihood = -1801.6831  

Logistic regression                             Number of obs     =      4,066
                                                LR chi2(8)        =    1572.30
                                                Prob > chi2       =     0.0000
Log likelihood = -1801.6831                     Pseudo R2         =     0.3038

---------------------------------------------------------------------------------
          hhe60 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.hhe60_minus1_ |    7.87879   .7231962    22.49   0.000      6.58154    9.431734
1.hhe60_minus2_ |   2.846406   .2849119    10.45   0.000     2.339352    3.463364
1.hhe60_minus3_ |   1.680441   .1645248     5.30   0.000      1.38703    2.035921
                |
           time |
             4  |   .9747497   .1279975    -0.19   0.846     .7535622    1.260861
             5  |   .8508048   .1156112    -1.19   0.234     .6518757     1.11044
             6  |   1.091497    .151576     0.63   0.528     .8314119    1.432942
             7  |   1.021731   .1490559     0.15   0.883      .767642    1.359924
             8  |   1.125834    .179029     0.75   0.456     .8243605    1.537559
                |
          _cons |   .1165569   .0120177   -20.85   0.000     .0952301    .1426598
---------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. logit hhe60 i.hhe60_minus1 i.hhe60_minus2 i.hhe60_minus3 i.hhe60_minus4 i.time, or

Iteration 0:   log likelihood = -1787.4168  
Iteration 1:   log likelihood = -1241.3037  
Iteration 2:   log likelihood = -1227.7738  
Iteration 3:   log likelihood = -1227.6995  
Iteration 4:   log likelihood = -1227.6994  

Logistic regression                             Number of obs     =      2,824
                                                LR chi2(8)        =    1119.43
                                                Prob > chi2       =     0.0000
Log likelihood = -1227.6994                     Pseudo R2         =     0.3131

---------------------------------------------------------------------------------
          hhe60 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.hhe60_minus1_ |   8.415087   .9351114    19.17   0.000     6.768157    10.46277
1.hhe60_minus2_ |   2.607613   .3194475     7.82   0.000     2.051002     3.31528
1.hhe60_minus3_ |   1.478364   .1910824     3.02   0.002     1.147523    1.904589
1.hhe60_minus4_ |   1.376745   .1694237     2.60   0.009     1.081692    1.752279
                |
           time |
             5  |   .8635812   .1286064    -0.98   0.325     .6449714    1.156288
             6  |   1.066749   .1619856     0.43   0.670     .7921503    1.436538
             7  |    1.06943   .1695783     0.42   0.672     .7837511    1.459239
             8  |   1.163125   .1986869     0.88   0.376     .8321907    1.625661
                |
          _cons |   .1060643    .012546   -18.97   0.000      .084117     .133738
---------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. margins hhe60_minus1_

Predictive margins                              Number of obs     =      2,824
Model VCE    : OIM

Expression   : Pr(hhe60), predict()

-------------------------------------------------------------------------------
              |            Delta-method
              |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
hhe60_minus1_ |
           0  |   .1786551   .0101962    17.52   0.000      .158671    .1986392
           1  |   .5984648   .0194211    30.82   0.000     .5604002    .6365294
-------------------------------------------------------------------------------

. margins hhe60_minus2_

Predictive margins                              Number of obs     =      2,824
Model VCE    : OIM

Expression   : Pr(hhe60), predict()

-------------------------------------------------------------------------------
              |            Delta-method
              |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
hhe60_minus2_ |
           0  |    .268078   .0111174    24.11   0.000     .2462882    .2898678
           1  |   .4232959   .0169963    24.91   0.000     .3899837    .4566081
-------------------------------------------------------------------------------

. margins hhe60_minus3_

Predictive margins                              Number of obs     =      2,824
Model VCE    : OIM

Expression   : Pr(hhe60), predict()

-------------------------------------------------------------------------------
              |            Delta-method
              |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
hhe60_minus3_ |
           0  |   .3053107   .0105808    28.86   0.000     .2845727    .3260487
           1  |   .3617593   .0141651    25.54   0.000     .3339962    .3895224
-------------------------------------------------------------------------------

. margins hhe60_minus4_

Predictive margins                              Number of obs     =      2,824
Model VCE    : OIM

Expression   : Pr(hhe60), predict()

-------------------------------------------------------------------------------
              |            Delta-method
              |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
hhe60_minus4_ |
           0  |   .3100052   .0100467    30.86   0.000     .2903141    .3296964
           1  |   .3553041   .0132602    26.79   0.000     .3293147    .3812936
-------------------------------------------------------------------------------

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\Joanna\Dropbox\Repositories\NLSY97_Breadwinning\logs\nlsy97_hh60_2019.05.20.log
  log type:  text
 closed on:  20 May 2019, 12:40:42
--------------------------------------------------------------------------------------------------------
