--------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Joanna\Dropbox\Repositories\NLSY97_Breadwinning\logs\nlsy97_hh60_2019.05.11.log
  log type:  text
 opened on:  11 May 2019, 12:12:22

. 
. use     "C:\Users\Joanna\Dropbox\Repositories\NLSY97_Breadwinning\stata\nlsy97_hh60.dta", clear
(Written by R.              )

. 
. *select only observations since first birth
. keep if firstbirth==1   // selected on this in R already
(0 observations deleted)

. 
. drop firstbirth                 // this variable has no variation now 

. 
. reshape wide year hhe60, i(PUBID_1997) j(time)
(note: j = 0 1 2 3 4 5 6 7 8 9)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    18448   ->    1998
Number of variables                   4   ->      21
j variable (10 values)             time   ->   (dropped)
xij variables:
                                   year   ->   year0 year1 ... year9
                                  hhe60   ->   hhe600 hhe601 ... hhe609
-----------------------------------------------------------------------------

. 
. forvalues t=1/8{
  2.     local s=`t'-1
  3.     gen hhe60_minus1_`t'=hhe60`s' 
  4. }
(536 missing values generated)
(543 missing values generated)
(535 missing values generated)
(604 missing values generated)
(614 missing values generated)
(744 missing values generated)
(797 missing values generated)
(987 missing values generated)

. 
. forvalues t=2/8{
  2.     local r=`t'-2
  3.     gen hhe60_minus2_`t'=hhe60`r' 
  4. }
(536 missing values generated)
(543 missing values generated)
(535 missing values generated)
(604 missing values generated)
(614 missing values generated)
(744 missing values generated)
(797 missing values generated)

. 
. forvalues t=3/8{
  2.     local r=`t'-3
  3.     gen hhe60_minus3_`t'=hhe60`r' 
  4. }
(536 missing values generated)
(543 missing values generated)
(535 missing values generated)
(604 missing values generated)
(614 missing values generated)
(744 missing values generated)

. 
. reshape long year hhe60 hhe60_minus1_ hhe60_minus2_ hhe60_minus3_, i(PUBID_1997) j(time)
(note: j = 0 1 2 3 4 5 6 7 8 9)
(note: hhe60_minus1_0 not found)
(note: hhe60_minus2_0 not found)
(note: hhe60_minus3_0 not found)
(note: hhe60_minus2_1 not found)
(note: hhe60_minus3_1 not found)
(note: hhe60_minus3_2 not found)
(note: hhe60_minus1_9 not found)
(note: hhe60_minus2_9 not found)
(note: hhe60_minus3_9 not found)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1998   ->   19980
Number of variables                  42   ->       7
j variable (10 values)                    ->   time
xij variables:
                  year0 year1 ... year9   ->   year
               hhe600 hhe601 ... hhe609   ->   hhe60
hhe60_minus1_0 hhe60_minus1_1 ... hhe60_minus1_9->hhe60_minus1_
hhe60_minus2_0 hhe60_minus2_1 ... hhe60_minus2_9->hhe60_minus2_
hhe60_minus3_0 hhe60_minus3_1 ... hhe60_minus3_9->hhe60_minus3_
-----------------------------------------------------------------------------

. 
. * clean up observations created because reshape creates some number of observations for each (PUBID_19
> 97)
. drop if missing(year)
(1,532 observations deleted)

. 
. logit hhe60 hhe60_minus1 i.time

Iteration 0:   log likelihood = -4898.5708  
Iteration 1:   log likelihood = -3614.3489  
Iteration 2:   log likelihood =  -3591.955  
Iteration 3:   log likelihood = -3591.9133  
Iteration 4:   log likelihood = -3591.9133  

Logistic regression                             Number of obs     =      7,569
                                                LR chi2(8)        =    2613.31
                                                Prob > chi2       =     0.0000
Log likelihood = -3591.9133                     Pseudo R2         =     0.2667

-------------------------------------------------------------------------------
        hhe60 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
hhe60_minus1_ |   2.751946   .0595321    46.23   0.000     2.635265    2.868627
              |
         time |
           2  |  -.1341998   .1058834    -1.27   0.205    -.3417275    .0733278
           3  |   .0468647   .1067446     0.44   0.661     -.162351    .2560803
           4  |   .0280839    .108538     0.26   0.796    -.1846467    .2408145
           5  |   -.088308   .1121247    -0.79   0.431    -.3080683    .1314524
           6  |   .1112505   .1158369     0.96   0.337    -.1157856    .3382865
           7  |   .0395926   .1239186     0.32   0.749    -.2032834    .2824686
           8  |   .0605182   .1369896     0.44   0.659    -.2079764    .3290129
              |
        _cons |  -1.778364   .0791917   -22.46   0.000    -1.933577   -1.623151
-------------------------------------------------------------------------------

. logit hhe60 hhe60_minus1 hhe60_minus2 i.time

Iteration 0:   log likelihood = -3603.5641  
Iteration 1:   log likelihood = -2550.8008  
Iteration 2:   log likelihood = -2528.4388  
Iteration 3:   log likelihood = -2528.3436  
Iteration 4:   log likelihood = -2528.3435  

Logistic regression                             Number of obs     =      5,630
                                                LR chi2(8)        =    2150.44
                                                Prob > chi2       =     0.0000
Log likelihood = -2528.3435                     Pseudo R2         =     0.2984

-------------------------------------------------------------------------------
        hhe60 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
hhe60_minus1_ |    2.16781   .0766727    28.27   0.000     2.017534    2.318086
hhe60_minus2_ |   1.228057   .0768917    15.97   0.000     1.077352    1.378762
              |
         time |
           3  |   .2099085   .1195908     1.76   0.079    -.0244851    .4443021
           4  |   .2199084   .1209039     1.82   0.069     -.017059    .4568757
           5  |   .0670337   .1251963     0.54   0.592    -.1783466     .312414
           6  |   .2754371   .1285097     2.14   0.032     .0235627    .5273116
           7  |   .1760177   .1361868     1.29   0.196    -.0909036     .442939
           8  |   .2664735   .1494927     1.78   0.075    -.0265268    .5594737
              |
        _cons |  -2.230627   .0939644   -23.74   0.000    -2.414794   -2.046461
-------------------------------------------------------------------------------

. logit hhe60 hhe60_minus1 hhe60_minus2 hhe60_minus3 i.time

Iteration 0:   log likelihood = -2587.8355  
Iteration 1:   log likelihood = -1819.0254  
Iteration 2:   log likelihood = -1801.7641  
Iteration 3:   log likelihood = -1801.6831  
Iteration 4:   log likelihood = -1801.6831  

Logistic regression                             Number of obs     =      4,066
                                                LR chi2(8)        =    1572.30
                                                Prob > chi2       =     0.0000
Log likelihood = -1801.6831                     Pseudo R2         =     0.3038

-------------------------------------------------------------------------------
        hhe60 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
hhe60_minus1_ |   2.064174   .0917903    22.49   0.000     1.884269     2.24408
hhe60_minus2_ |   1.046057   .1000953    10.45   0.000     .8498738     1.24224
hhe60_minus3_ |   .5190565   .0979057     5.30   0.000     .3271648    .7109482
              |
         time |
           4  |  -.0255745   .1313132    -0.19   0.846    -.2829437    .2317947
           5  |  -.1615726   .1358846    -1.19   0.234    -.4279014    .1047563
           6  |     .08755   .1388699     0.63   0.528      -.18463    .3597299
           7  |   .0214986   .1458856     0.15   0.883    -.2644318    .3074291
           8  |   .1185242    .159019     0.75   0.456    -.1931473    .4301958
              |
        _cons |  -2.149376   .1031057   -20.85   0.000     -2.35146   -1.947292
-------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\Joanna\Dropbox\Repositories\NLSY97_Breadwinning\logs\nlsy97_hh60_2019.05.11.log
  log type:  text
 closed on:  11 May 2019, 12:12:23
--------------------------------------------------------------------------------------------------------
