------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Joanna\Dropbox\Repositories\NLSY97_Breadwinning\logs\nlsy97_hh50_2019.05.0
> 8.log
  log type:  text
 opened on:   8 May 2019, 19:12:40

. 
. use     "C:\Users\Joanna\Dropbox\Repositories\NLSY97_Breadwinning\nlsy97_hh50.dta", clear
(Written by R.              )

. 
. *select only observations since first birth
. // JP: Don't we want the breadwinning status for the two years BEFORE firstbirth?
. // I changed this variable so 1 equals 2 years prior to first birth and every year after. Wron
> g?
. keep if firstbirth==1   
(10,918 observations deleted)

. 
. drop firstbirth                 // this variable has no variation now 

. 
. // NOTE: Time is lagged by 1 year because respondents reported earnings the year before surver
> y year (year)
. 
. // Code won't run with negative values
. replace time = time + 2
(18,017 real changes made)

. label define timelbl    1 "Minus 2" 2 "Minus 1" 3 "Year of 1st Birth" 4 "Plus 1" 5 "Plus 2" 6 
> "Plus 3" ///
>                                                 7 "Plus 4"      8 "Plus 5"      9 "Plus 6"    
>   10 "Plus 7" 11 "Plus 8" 12 "Plus 9" 13 "Plus 10"

. label values time timelbl

. 
. drop if time == .               // Can't run next code with missing time data
(2,147 observations deleted)

. 
. reshape wide year hhe50, i(PUBID_1997) j(time)
(note: j = 0 1 2 3 4 5 6 7 8 9 10 11)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    18017   ->    1993
Number of variables                   5   ->      26
j variable (12 values)             time   ->   (dropped)
xij variables:
                                   year   ->   year0 year1 ... year11
                                  hhe50   ->   hhe500 hhe501 ... hhe5011
-----------------------------------------------------------------------------

. 
. forvalues t=1/8{
  2.     local s=`t'-1
  3.     gen hhe50_minus1_`t'=hhe50`s' 
  4. }
(694 missing values generated)
(540 missing values generated)
(531 missing values generated)
(538 missing values generated)
(530 missing values generated)
(599 missing values generated)
(609 missing values generated)
(739 missing values generated)

. 
. forvalues t=2/8{
  2.     local r=`t'-2
  3.     gen hhe50_minus2_`t'=hhe50`r' 
  4. }
(694 missing values generated)
(540 missing values generated)
(531 missing values generated)
(538 missing values generated)
(530 missing values generated)
(599 missing values generated)
(609 missing values generated)

. 
. reshape long year hhe50 hhe50_minus1_ hhe50_minus2_, i(PUBID_1997) j(time)
(note: j = 0 1 2 3 4 5 6 7 8 9 10 11)
(note: hhe50_minus1_0 not found)
(note: hhe50_minus2_0 not found)
(note: hhe50_minus2_1 not found)
(note: hhe50_minus1_9 not found)
(note: hhe50_minus2_9 not found)
(note: hhe50_minus1_10 not found)
(note: hhe50_minus2_10 not found)
(note: hhe50_minus1_11 not found)
(note: hhe50_minus2_11 not found)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1993   ->   23916
Number of variables                  41   ->       7
j variable (12 values)                    ->   time
xij variables:
                 year0 year1 ... year11   ->   year
              hhe500 hhe501 ... hhe5011   ->   hhe50
hhe50_minus1_0 hhe50_minus1_1 ... hhe50_minus1_11->hhe50_minus1_
hhe50_minus2_0 hhe50_minus2_1 ... hhe50_minus2_11->hhe50_minus2_
-----------------------------------------------------------------------------

. 
. * clean up observations created because reshape creates some number of observations for each (
> PUBID_1997)
. drop if missing(year)
(5,899 observations deleted)

. 
. logit hhe50 hhe50_minus1 i.time

Iteration 0:   log likelihood = -5879.9214  
Iteration 1:   log likelihood = -4540.9721  
Iteration 2:   log likelihood = -4529.1552  
Iteration 3:   log likelihood = -4529.1418  
Iteration 4:   log likelihood = -4529.1418  

Logistic regression                             Number of obs     =      8,724
                                                LR chi2(8)        =    2701.56
                                                Prob > chi2       =     0.0000
Log likelihood = -4529.1418                     Pseudo R2         =     0.2297

------------------------------------------------------------------------------------
             hhe50 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
     hhe50_minus1_ |   2.486039    .052693    47.18   0.000     2.382762    2.589315
                   |
              time |
          Minus 1  |  -.1621574   .0999018    -1.62   0.105    -.3579613    .0336464
Year of 1st Birth  |   .0749353   .1007124     0.74   0.457    -.1224573    .2723279
           Plus 1  |  -.0398463   .1007574    -0.40   0.692    -.2373271    .1576345
           Plus 2  |   .1223141   .1020938     1.20   0.231    -.0777861    .3224143
           Plus 3  |   .1215544   .1036934     1.17   0.241    -.0816809    .3247897
           Plus 4  |   .0342776   .1067097     0.32   0.748    -.1748696    .2434247
           Plus 5  |   .1924424   .1107202     1.74   0.082    -.0245653      .40945
                   |
             _cons |  -1.607408    .079344   -20.26   0.000    -1.762919   -1.451896
------------------------------------------------------------------------------------

. logit hhe50 hhe50_minus1 hhe50_minus2 i.time

Iteration 0:   log likelihood = -4363.1453  
Iteration 1:   log likelihood = -3217.0332  
Iteration 2:   log likelihood = -3202.5704  
Iteration 3:   log likelihood = -3202.5376  
Iteration 4:   log likelihood = -3202.5376  

Logistic regression                             Number of obs     =      6,559
                                                LR chi2(8)        =    2321.22
                                                Prob > chi2       =     0.0000
Log likelihood = -3202.5376                     Pseudo R2         =     0.2660

------------------------------------------------------------------------------------
             hhe50 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
     hhe50_minus1_ |   2.061047    .067065    30.73   0.000     1.929602    2.192492
     hhe50_minus2_ |   1.085947   .0674915    16.09   0.000      .953666    1.218228
                   |
              time |
Year of 1st Birth  |   .3230375   .1124709     2.87   0.004     .1025985    .5434765
           Plus 1  |   .2256528   .1138779     1.98   0.048     .0024563    .4488494
           Plus 2  |   .4422841   .1138617     3.88   0.000     .2191194    .6654489
           Plus 3  |   .4634709   .1156741     4.01   0.000     .2367538    .6901881
           Plus 4  |   .3153375   .1190904     2.65   0.008     .0819246    .5487505
           Plus 5  |   .4805185   .1228972     3.91   0.000     .2396444    .7213925
                   |
             _cons |  -2.223788    .093654   -23.74   0.000    -2.407347    -2.04023
------------------------------------------------------------------------------------

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\Joanna\Dropbox\Repositories\NLSY97_Breadwinning\logs\nlsy97_hh50_2019.05.0
> 8.log
  log type:  text
 closed on:   8 May 2019, 19:12:40
------------------------------------------------------------------------------------------------
